sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/mcu/Mcu_Platform.c
/*******************************************************************************
**                                                                            **
** Copyright (C) Infineon Technologies (2013)                                 **
**                                                                            **
** All rights reserved.                                                       **
**                                                                            **
** This document contains proprietary information belonging to Infineon       **
** Technologies. Passing on and copying of this document, and communication   **
** of its contents is not permitted without prior written authorization.      **
**                                                                            **
********************************************************************************
**                                                                            **
**  $FILENAME   : Mcu_Platform.c $                                           **
**                                                                            **
**  $CC VERSION : \main\dev_tc23x\dev_patch_rel330\1 $                       **
**                                                                            **
**  $DATE       : 2017-05-13 $                                               **
**                                                                            **
**  AUTHOR      : DL-AUTOSAR-Engineering                                      **
**                                                                            **
**  VENDOR      : Infineon Technologies                                       **
**                                                                            **
**  DESCRIPTION : This file contains AURIX derivative (platform specific)     **
**                functionality of MCU driver.                                **
**                                                                            **
**  MAY BE CHANGED BY USER [yes/no]: No                                       **
**                                                                            **
*******************************************************************************/
/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/
  /* Inclusion of controller sfr file */
#include "IfxScu_reg.h"
#include "IfxScu_bf.h"
#include "Mcu.h"
#include "Mcu_Local.h"



/*******************************************************************************
**                      Global Constant Definitions                           **
*******************************************************************************/

/*******************************************************************************
**                      Global Variable Definitions                           **
*******************************************************************************/
/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/
/* MACRO for Hardware timeout */
#define MCU_ERAY_MAX_TIMEOUT                 ((uint32)0x000001FFU)

/* MACRO for Oscillator to be disabled and power saving mode enabled */
#define MCU_OSCCON_DISOSC                    (3U)

/* CPU0  RAM is supplied in Stand by mode*/
#define MCU_CPU0_STBYRAM_SUPPLIED            (1U)

/* Entry to standby is via REQSLP */
#define MCU_STBYEV_ENRTY_REQSLP              (0U)

/* Mask Values to be verified in Mcu_InitCheck */
#define MCU_PMSWCR0_MASK                     ((uint32)0x2080FF8EU)

/* MASK for CCUCON Registers divider values */
#define MCU_CCUCON0_MASK_CLOCK_DIVIDERS      ((uint32)0x033F0FF8U)
#define MCU_CCUCON1_MASK_CLOCK_DIVIDERS      ((uint32)0x0FFFFFFFU)
#define MCU_CCUCON2_MASK_CLOCK_DIVIDERS      ((uint32)0x0000000FU)
#define MCU_CCUCON5_MASK_CLOCK_DIVIDERS      ((uint32)0x0000004FU)
#define MCU_CCUCON6_MASK_CLOCK_DIVIDERS      ((uint32)0x0000003FU)
#define MCU_CCUCON3_MASK_CLOCK_DIVIDERS      ((uint32)0x00FFFFFFU)
#define MCU_CCUCON4_MASK_CLOCK_DIVIDERS      ((uint32)0x00FFFFFFU)


/* MACRO for setting default value of PMSWCR0 during standby by MCU driver */
#define MCU_PMSWCR0_DEFAULT_VALUE            ((uint32)0x00620000U)

/* Reset Status types of MCU needed for internal use in a raw form */
/* ESR0 reset */
#define MCU_RAW_ESR0_RESET          ((Mcu_RawResetType)(0x00000001U))
/* ESR1 reset */
#define MCU_RAW_ESR1_RESET          ((Mcu_RawResetType)(0x00000002U))
/* SMU reset */
#define MCU_RAW_SMU_RESET           ((Mcu_RawResetType)(0x00000008U))
/* Software reset */
#define MCU_RAW_SW_RESET            ((Mcu_RawResetType)(0x00000010U))
/* STM0 Reset*/
#define MCU_RAW_STM0_RESET          ((Mcu_RawResetType)(0x00000020U))
/* STM1 Reset*/
#define MCU_RAW_STM1_RESET          ((Mcu_RawResetType)(0x00000040U))
/* STM2 Reset*/
#define MCU_RAW_STM2_RESET          ((Mcu_RawResetType)(0x00000080U))
/* Power On reset on battery connect*/
#define MCU_RAW_POWER_ON_RESET_1    ((Mcu_RawResetType)(0x12810000U))
/* Power On reset, Pulling down PORST Line */
#define MCU_RAW_POWER_ON_RESET_2    ((Mcu_RawResetType)(0x00010000U))
/*Cerberus System Reset*/
#define MCU_RAW_CB0_RESET           ((Mcu_RawResetType)(0x00040000U))
/*Cerberus Debug Reset*/
#define MCU_RAW_CB1_RESET           ((Mcu_RawResetType)(0x00080000U))
/*Cerberus Application Reset*/
#define MCU_RAW_CB3_RESET           ((Mcu_RawResetType)(0x00100000U))
/* Tuning Protection Reset*/
#define MCU_RAW_TP_RESET            ((Mcu_RawResetType)(0x00200000U))
/* EVR13 Reset*/
#define MCU_RAW_EVR13_RESET         ((Mcu_RawResetType)(0x00810000U))
/* EVR33 Reset*/
#define MCU_RAW_EVR33_RESET         ((Mcu_RawResetType)(0x01010000U))
/* Supply Watchdog Reset*/
#define MCU_RAW_SUPPLY_WDOG_RESET   ((Mcu_RawResetType)(0x02010000U))
/* Standby Regualtor Watchdog Reset*/
#define MCU_RAW_STBYR_RESET         ((Mcu_RawResetType)(0x10010000U))

#define MCU_CCUCON3_UP_CLEARMASK              0xBFFFFFFFU
#define MCU_CCUCON3_UP_SETMASK                0x40000000U
#define MCU_CCUCON0_UP_CLEARMASK              0xBFFFFFFFU
#define MCU_CCUCON1_UP_CLEARMASK              0xBFFFFFFFU
#define MCU_CCUCON2_UP_CLEARMASK              0xBFFFFFFFU
#define MCU_CCUCON5_UP_CLEARMASK              0xBFFFFFFFU
#define MCU_CCUCON0_UP_CLEARMASK1             0xBFFFFFFFU
#define MCU_CCUCON0_UP_SETMASK1               0x40000008U
#define MCU_CCUCON2_UP_CLEARMASK1             0xBFFFFFFFU
#define MCU_CCUCON2_UP_SETMASK1               0x40000000U
#define MCU_PLLERAYCON1_K1DIV_CLEARMASK       0xFF80FFFFU
#define MCU_PLLERAYCON0_VCOBYP_CLEARMASK      0xFFFFBFFEU
#define MCU_PLLERAYCON0_SETFINDIS_CLEARMASK   0xFFFFBFEFU
#define MCU_PLLERAYCON1_K2DIV_CLEARMASK       0xFFFFFF80U
#define MCU_PLLERAYCON1_K3DIV_CLEARMASK       0xFFFFF0FFU
#define MCU_PLLERAYCON0_PDIV_CLEARMASK        0xF0FFBFFFU
#define MCU_PLLERAYCON0_NDIV_CLEARMASK        0xFFFF81FFU
#define MCU_PLLERAYCON0_OSCDISCDIS_CLEARMASK  0xFFFFBFBFU
#define MCU_PLLERAYCON0_PLLPWD_CLEARMASK      0xFFFEBFFFU
#define MCU_PLLERAYCON0_PLLPWD_SETMASK        0x00000000U
#define MCU_PLLERAYCON0_CLRFINDIS_CLEARMASK   0xFFFFBFDFU
#define MCU_PLLERAYCON0_RESLD_CLEARMASK       0xFFFBBFFFU
#define MCU_PLLERAYCON0_VCOBYP_CLEARMASK1     0xFFFFBFFEU
#define MCU_PLLERAYCON0_OSCDISCDIS_CLEARMASK1 0xFFFFBFBFU
#define MCU_CCUCON_CLEARMASK                  0xFFFFFFFFU
#define MCU_OSCCON_CLEARMASK                  0xFFFFFFFFU
#define MCU_CCUCON_CLEARMASK1                 0xCFFFFFFFU
#define MCU_CCUCON_SETMASK                    0x40000000U
#define MCU_CCUCON_SETMASK1                   0x00000060U
#define MCU_OSCCON_SETMASK1                   0x00000060U
#define MCU_PLLCON0_CLEARMASK                 0xFFFFFFFFU
#define MCU_PLLERAYCON0_CLEARMASK             0xFFFFFFFFU
#define MCU_PLLCON0_SETMASK                   0x00000002U
#define MCU_PLLERAYCON0_SETMASK               0x00000002U
#define MCU_PLLCON0_CLEARMASK1                0xFFFEFFFFU
#define MCU_PLLERAYCON0_CLEARMASK1            0xFFFEBFFFU
#define MCU_PMSWCR0_CLEARMASK                 0xFFFBFFFFU
#define MCU_PMSWCR1_CLEARMASK                 0x8FFFFFFFU
#define MCU_PMSWCR0_SETMASK                   0x00020000U
#define MCU_PMSWCR1_SETMASK                   0x08001000U
#define MCU_CCUCON5_BIT6_SETMASK              0x00000040U
#define MCU_PLLERAYSTAT_VCOLOCK_CLEARMASK     0x00000004U
#define MCU_PLLERAYCON0_SETFINDIS_BITPOS        4U
#define MCU_PLLERAYCON1_K3DIV_BITPOS            8U
#define MCU_PLLERAYCON0_PDIV_BITPOS             24U
#define MCU_PLLERAYCON0_NDIV_BITPOS             9U
#define MCU_PLLERAYCON0_OSCDISCDIS_BITPOS       6U
#define MCU_PLLERAYCON0_CLRFINDIS_BITPOS        5U
#define MCU_PLLERAYCON0_PLLPWD_BITPOS           16U
#define MCU_PLLERAYCON0_RESLD_BITPOS            18U
#define MCU_PLLERAYSTAT_VCOLOCK_BITPOS          2U

