sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/mcu/Mcu_Platform.c
}/* End of Mcu_lInitClockMonitoring() */

#endif /*End Of MCU_ENABLE_CLOCK_MONITORING*/


/*******************************************************************************
** Syntax : Std_ReturnType Mcu_lPlatformInit (void)                           **
**                                                                            **
** Service ID:    None                                                        **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non-reentrant                                               **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:  E_OK if successful else E_NOT_OK                            **
**                                                                            **
** Description :  This service shall initialize platform specific             **
**                functionality.                                              **
**                                                                            **
*******************************************************************************/
Std_ReturnType Mcu_lPlatformInit(void)
{
  Std_ReturnType RetValue = E_OK;
 MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
 /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
 if((Mcu_lInitCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON0.U))\
                                          != (uint32)MCU_BITVAL_0)
 {

   /* Initialize all clock dividers */
   /*Reserve bit access is ensured for CCUCON0 register*/
   MCU_SFR_INIT_MODIFY32(SCU_CCUCON0.U,MCU_CCUCON0_UP_CLEARMASK,8U)
   
  }
  /*Reserve bit access is ensured for CCUCON0 register*/
   /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
   if((Mcu_lInitCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON0.U))\
                                          != (uint32)MCU_BITVAL_0)
   {
     /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
     MCU_SFR_INIT_WRITE32(SCU_CCUCON0.U,(unsigned_int)\
                    ((Mcu_kConfigPtr->ClockCfgPtr[Mcu_ClockSetting].Ccucon0) &\
                                           MCU_CCUCON0_MASK_CLOCK_DIVIDERS)|8U);
   }
  MCU_SFR_INIT_SETSAFETYENDINIT_TIMED();

 
  MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
 /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
 if((Mcu_lInitCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON1.U))\
                                          != (uint32)MCU_BITVAL_0)
 {

   MCU_SFR_INIT_MODIFY32(SCU_CCUCON1.U,MCU_CCUCON1_UP_CLEARMASK,0U)
  }
   /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
   if((Mcu_lInitCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON1.U))\
                                          != (uint32)MCU_BITVAL_0)
   {
     /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
     MCU_SFR_INIT_WRITE32(SCU_CCUCON1.U,(unsigned_int)\
                   (((Mcu_kConfigPtr->ClockCfgPtr[Mcu_ClockSetting].Ccucon1) &\
                MCU_CCUCON1_MASK_CLOCK_DIVIDERS)|MCU_INSEL_IS_FOSC0_AS_SOURCE));
   }
   MCU_SFR_INIT_SETSAFETYENDINIT_TIMED();
 

  MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
  /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
  if((Mcu_lInitCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON2.U))\
                                          != (uint32)MCU_BITVAL_0)
  {
  

    MCU_SFR_INIT_MODIFY32(SCU_CCUCON2.U,MCU_CCUCON2_UP_CLEARMASK,0U)
  }
   /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
   if((Mcu_lInitCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON2.U))\
                                          != (uint32)MCU_BITVAL_0)
   {
     /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
     MCU_SFR_INIT_WRITE32(SCU_CCUCON2.U,(unsigned_int)\
                    ((Mcu_kConfigPtr->ClockCfgPtr[Mcu_ClockSetting].Ccucon2) &\
                                              MCU_CCUCON2_MASK_CLOCK_DIVIDERS));
   } 
    MCU_SFR_INIT_SETSAFETYENDINIT_TIMED();
   
  MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
  /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
  if((Mcu_lInitCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON5.U))\
                                          != (uint32)MCU_BITVAL_0)
  {
 
    /*Reserve bit access is ensured for CCUCON5 register*/
    MCU_SFR_INIT_MODIFY32(SCU_CCUCON5.U,MCU_CCUCON5_UP_CLEARMASK,\
                                                       MCU_CCUCON5_BIT6_SETMASK)
    }
    /*Reserve bit access is ensured for CCUCON5 register*/
   /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
   if((Mcu_lInitCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON5.U))\
                                          != (uint32)MCU_BITVAL_0)
   {
    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
    MCU_SFR_INIT_WRITE32(SCU_CCUCON5.U,((unsigned_int)\
                    (Mcu_kConfigPtr->ClockCfgPtr[Mcu_ClockSetting].Ccucon5)));
   }
    MCU_SFR_INIT_SETSAFETYENDINIT_TIMED();
  
  MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
  /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
  if((Mcu_lInitCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON0.U))\
                                          != (uint32)MCU_BITVAL_0)
  {
 
    /* Single Update for all CCUCON0,1,5 registers*/
    /*Reserve bit access is ensured for CCUCON0 register*/
    MCU_SFR_INIT_MODIFY32(SCU_CCUCON0.U,MCU_CCUCON0_UP_CLEARMASK1,\
                                                    MCU_CCUCON0_UP_SETMASK1)
    }                                                
    /* Single Update for all CCUCON2 registers*/
   /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
   if((Mcu_lInitCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON2.U))\
                                          != (uint32)MCU_BITVAL_0)
   {
    MCU_SFR_INIT_MODIFY32(SCU_CCUCON2.U,MCU_CCUCON2_UP_CLEARMASK1,\
                                                        MCU_CCUCON2_UP_SETMASK1)
   }
    MCU_SFR_INIT_SETSAFETYENDINIT_TIMED();
   
  MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);

