sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/mcu/Mcu_Platform.c
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
  PllK2div = Mcu_kConfigPtr->\
             ClockCfgPtr[ClockSetting].MCU_ErayPllDivValues.McuErayK2Divider;

  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
  PllK3div = Mcu_kConfigPtr->\
             ClockCfgPtr[ClockSetting].MCU_ErayPllDivValues.McuErayK3Divider;
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
  PllPdiv = Mcu_kConfigPtr->\
             ClockCfgPtr[ClockSetting].MCU_ErayPllDivValues.McuErayPDivider;

  /* delay count value is configured using parameter McuErayPllInitDelay. 
  User to configure such that value of macro MCU_CONF_DELAY_ERAY_PLL is 
  1000 or more to reach 10us delay as in errata */
  ErayPllDelay = MCU_CONF_DELAY_ERAY_PLL;
  
  /* Errata: PLL_ERAY_TC.001(PLL_ERAY initialization after cold power-up) */
  MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
  /*Reserve bit access is ensured for PLLERAYCON0 register*/
  /* set PLL_ERAY to power saving mode */ 
  /* Set PLLPWD(bit 16) to 0*/
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON0.U,MCU_PLLERAYCON0_PLLPWD_CLEARMASK,\
                                                 MCU_PLLERAYCON0_PLLPWD_SETMASK)
  MCU_SFR_INIT_SETSAFETYENDINIT_TIMED();
  
  /* delay */
  for(;ErayPllDelay > 0U;ErayPllDelay--)
  {
    NOP();
  }
  
  MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
  /*Reserve bit access is ensured for PLLERAYCON0 register*/
  /* Set PLL_ERAY Power Saving Mode to normal behaviour */                     
  /* Set PLLPWD(bit 16) to 1*/
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON0.U,MCU_PLLERAYCON0_PLLPWD_CLEARMASK,\
                                      (uint32)1U<<MCU_PLLERAYCON0_PLLPWD_BITPOS)
  MCU_SFR_INIT_SETSAFETYENDINIT_TIMED();
  /* ----- End of Errata PLL_ERAY_TC.001 workaround ----- */

  MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
  /* Enter Prescalar mode */
  /* Update K and N dividers */
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON1.U,MCU_PLLERAYCON1_K1DIV_CLEARMASK,0U)

  /*Reserve bit access is ensured for PLLERAYCON0 register*/
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON0.U,MCU_PLLERAYCON0_VCOBYP_CLEARMASK,1U)

  /*Reserve bit access is ensured for PLLERAYCON0 register*/
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON0.U,MCU_PLLERAYCON0_SETFINDIS_CLEARMASK,\
                                           1U<<MCU_PLLERAYCON0_SETFINDIS_BITPOS)
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON1.U,MCU_PLLERAYCON1_K2DIV_CLEARMASK,\
                                                                    PllK2div)
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON1.U,MCU_PLLERAYCON1_K3DIV_CLEARMASK,\
                                 (uint32)PllK3div<<MCU_PLLERAYCON1_K3DIV_BITPOS)

  /*Reserve bit access is ensured for PLLERAYCON0 register*/
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON0.U,MCU_PLLERAYCON0_PDIV_CLEARMASK,\
                                   (uint32)PllPdiv<<MCU_PLLERAYCON0_PDIV_BITPOS)

  /*Reserve bit access is ensured for PLLERAYCON0 register*/
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON0.U,MCU_PLLERAYCON0_NDIV_CLEARMASK,\
                                   (uint32)PllNdiv<<MCU_PLLERAYCON0_NDIV_BITPOS)
  /* Enter normal mode */

  /* In case of a PLL loss-of-lock bit PLLERAYSTAT.FINDIS is not set. 
  i.e., The input clock from the oscillator is connected to the VCO part, 
  in case of a PLL loss-of-lock bit */
  /*Reserve bit access is ensured for PLLERAYCON0 register*/
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON0.U,MCU_PLLERAYCON0_OSCDISCDIS_CLEARMASK,\
                                          1U<<MCU_PLLERAYCON0_OSCDISCDIS_BITPOS)

  /* The input clock from the oscillator is connected to the VCO part */
  /*Reserve bit access is ensured for PLLERAYCON0 register*/
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON0.U,MCU_PLLERAYCON0_CLRFINDIS_CLEARMASK,\
                                           1U<<MCU_PLLERAYCON0_CLRFINDIS_BITPOS)
  /*
    RESLD = 1     ==> Restart VCO lock detection
    CLRFINDIS = 1 ==> Connect OSC to PLL
    PLLPWD = 1    ==> PLL Power Saving Mode : Normal behaviour
    NDIV = FR_17_ERAY_PLL_NDIV (Pre-compile parameter)
  */

  /*Reserve bit access is ensured for PLLERAYCON0 register*/
  /* restart the VCO lock detection */
  MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON0.U,MCU_PLLERAYCON0_RESLD_CLEARMASK,\
                                     (uint32)1U << MCU_PLLERAYCON0_RESLD_BITPOS)

  /* Set the ENDINIT bit in the WDT_CON0 register again
  to enable the write-protection and to prevent a time-out */
  MCU_SFR_INIT_SETSAFETYENDINIT_TIMED();

  /* Wait for ERAY PLL VCO locking */
  ErrorFlag = Mcu_lErayPllWaitVcoLock();

  /*By Pass VCO only if PLL is locked*/
  if(ErrorFlag == E_OK)
  {
    /* Clear the ENDINIT bit in the WDT_CON0 register in order
    to disable the write-protection for registers protected
    via the EndInit feature */
    MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);

    /*Bypass VCO*/

    /*Reserve bit access is ensured for PLLERAYCON0 register*/
    MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON0.U,\
                                        MCU_PLLERAYCON0_VCOBYP_CLEARMASK1,0U)

    /* In case of a PLL loss-of-lock bit PLLERAYSTAT.FINDIS is set. 
    i.e., The input clock from the oscillator is disconnected
    from the VCO part, in case of a PLL loss-of-lock bit */
    /*Reserve bit access is ensured for PLLERAYCON0 register*/
    MCU_SFR_INIT_MODIFY32(SCU_PLLERAYCON0.U,\
                                    MCU_PLLERAYCON0_OSCDISCDIS_CLEARMASK1,0U)

    /* Set the ENDINIT bit in the WDT_CON0 register again
    to enable the write-protection and to prevent a time-out */
    MCU_SFR_INIT_SETSAFETYENDINIT_TIMED();
  }
  return(ErrorFlag);
}/*End of Mcu_lErayPllClockInit()*/
#endif

/*******************************************************************************
** Syntax : IFX_LOCAL_INLINE Std_ReturnType Mcu_lErayPllWaitVcoLock(void)     **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  non reentrant                                                 **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out):  none                                                    **
**                                                                            **
** Return value:  none                                                        **
**                                                                            **
** Description : Function to wait for ERAY PLL VCO locking                    **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE Std_ReturnType Mcu_lErayPllWaitVcoLock(void)
{
  Std_ReturnType ErrorFlag;
  uint32 TimeOutCount;

  ErrorFlag = E_OK;
  TimeOutCount = MCU_ERAY_MAX_TIMEOUT;
  do
  {
    TimeOutCount-- ;
  } while ((((MCU_SFR_INIT_USER_MODE_READ32(SCU_PLLERAYSTAT.U) &\
         MCU_PLLERAYSTAT_VCOLOCK_CLEARMASK)>>MCU_PLLERAYSTAT_VCOLOCK_BITPOS) \
                                                 != 1U) && (TimeOutCount > 0U));

