sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/mcu/Mcu_Platform.c
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_MCU_PR2869_PR2875_PR2877]            **
** Syntax : void Mcu_lSetStandbyMode(uint8 CoreId)                            **
** [/cover]                                                                   **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  non reentrant                                                 **
**                                                                            **
** Parameters (in): CoreId - Core Id                                          **
**                                                                            **
** Parameters (out):  none                                                    **
**                                                                            **
** Return value:  none                                                        **
**                                                                            **
** Description : Function to enter Standby mode for CoreId                    **
**                                                                            **
*******************************************************************************/
void Mcu_lSetStandbyMode(uint8 CoreId)
{
  UNUSED_PARAMETER(CoreId)

  /* Configure Standby only if enabled
   * and the core is authorized to enter system to standby
   */
  if (Mcu_kConfigPtr->StandbyCfgPtr != NULL_PTR)
  {
    uint32 LoopCtr;
    uint32 CrcValue;
    uint32 *RARPtr;

    /* Handle RAM redundancy data */
    Mcu_lHandleStandbyRAM();

    if (Mcu_kConfigPtr->StandbyCfgPtr->CrcCheckEnable == (uint8)TRUE)
    {
      CrcValue = 0U;
      /*IFX_MISRA_RULE_11_01_STATUS=Cast from unsigned int to pointer, this is
         required to assign the ram base address to local variable to access
         ram memory*/
      /*IFX_MISRA_RULE_11_03_STATUS=Cast from unsigned int to pointer, this is
         required to assign the ram base address to local variable to access
         ram memory*/
      RARPtr = (uint32*)MCU_STANDBY_DSPR0_RAR_AREA;
      for (LoopCtr = 0U; LoopCtr < MCU_STANDBY_DSPR0_RAR_SIZE; LoopCtr++)
      {
        CrcValue = (uint32) CRC32((uint32)CrcValue, (uint32)*RARPtr);
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to
        efficiently access the consecutive memory locations*/
        RARPtr++;
      }
      /* Store the caluclated CRC at the end of RAR area */
      *RARPtr = CrcValue;
    }

  #if (MCU_ENABLE_CLOCK_MONITORING == STD_ON)
  /* Disable the clock monitoring unit, Clear CCUCON3 and CCUCON4 */
  #if (MCU_SAFETY_ENABLE == STD_ON)
  MCU_SAFETY_RESETSAFETYENDINIT_TIMED(MCU_SID_SETMODE,\
                                 MCU_SAFETY_ENDINT_TIMEOUT);
  #else
  MCU_SFR_RUNTIME_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
  #endif 
  /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
  if((Mcu_lRuntimeCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON3.U))\
                                          != (uint32)MCU_BITVAL_0)
  { 
    MCU_SFR_RUNTIME_WRITE32(SCU_CCUCON3.U,0U);
  }
  /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
  if((Mcu_lRuntimeCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON4.U))\
                                          != (uint32)MCU_BITVAL_0)
  { 
    MCU_SFR_RUNTIME_WRITE32(SCU_CCUCON4.U,0U);
  } 
    /* Single Update for all CCUCON3 & 4 registers via CCUCON4.UP*/
  /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
  if((Mcu_lRuntimeCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON4.U))\
                                          != (uint32)MCU_BITVAL_0)
  {
    MCU_SFR_RUNTIME_MODIFY32(SCU_CCUCON4.U,MCU_CCUCON_CLEARMASK,\
                                                            MCU_CCUCON_SETMASK)
  } 
  #if (MCU_SAFETY_ENABLE == STD_ON)
  MCU_SAFETY_SETSAFETYENDINIT_TIMED(MCU_SID_SETMODE);
  #else
  MCU_SFR_RUNTIME_SETSAFETYENDINIT_TIMED();
  #endif

  #endif

  #if (MCU_SAFETY_ENABLE == STD_ON)
  MCU_SAFETY_RESETSAFETYENDINIT_TIMED(MCU_SID_SETMODE,\
                                             MCU_SAFETY_ENDINT_TIMEOUT);
  #else
  MCU_SFR_RUNTIME_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
  #endif 
    /*Select Back-up clock as the source for all clocks */
    /*Reserve bit access is ensured for CCUCON0 register*/
  /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
  if((Mcu_lRuntimeCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON0.U))\
                                          != (uint32)MCU_BITVAL_0)
  { 
    MCU_SFR_RUNTIME_MODIFY32(SCU_CCUCON0.U,MCU_CCUCON_CLEARMASK1,0U)
  }
    /* Back-up clock is used as clock source is transferred to the CCU.*/
  /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
  if((Mcu_lRuntimeCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON1.U))\
                                          != (uint32)MCU_BITVAL_0)
  {
    MCU_SFR_RUNTIME_MODIFY32(SCU_CCUCON1.U,MCU_CCUCON_CLEARMASK1,0U)
  } 
    /* Update for CCUCON0 and CCUCON1 via CCUCON1.UP*/
  /*IFX_MISRA_RULE_11_05_STATUS=volatile typecasting is removed, since it
    gives compile time warning in windriver compiler*/
  if((Mcu_lRuntimeCcuconLckBitCheck((volatile uint32 *)(void *)&SCU_CCUCON1.U))\
                                          != (uint32)MCU_BITVAL_0)
  {
    MCU_SFR_RUNTIME_MODIFY32(SCU_CCUCON1.U,MCU_CCUCON_CLEARMASK,\
                                                             MCU_CCUCON_SETMASK)
  }
    /* Disable Oscillator and put PLL/ERAY_PLL to power saving mode */
    #if (MCU_SAFETY_ENABLE == STD_ON)
     MCU_SAFETY_SETSAFETYENDINIT_TIMED(MCU_SID_SETMODE);
    #else
     MCU_SFR_RUNTIME_SETSAFETYENDINIT_TIMED();
    #endif 
 
    #if (MCU_SAFETY_ENABLE == STD_ON)
     MCU_SAFETY_RESETSAFETYENDINIT_TIMED(MCU_SID_SETMODE,\
                             MCU_SAFETY_ENDINT_TIMEOUT);
    #else
     MCU_SFR_RUNTIME_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
    #endif 
    MCU_SFR_RUNTIME_MODIFY32(SCU_OSCCON.U,MCU_OSCCON_CLEARMASK,\
                                                            MCU_OSCCON_SETMASK1)
    /* VCO in Power Saving Mode */

    MCU_SFR_RUNTIME_MODIFY32(SCU_PLLCON0.U,MCU_PLLCON0_CLEARMASK,\
                                                            MCU_PLLCON0_SETMASK)

    /*Reserve bit access is ensured for PLLERAYCON0 register*/
    MCU_SFR_RUNTIME_MODIFY32(SCU_PLLERAYCON0.U,MCU_PLLERAYCON0_CLEARMASK,\
                                                        MCU_PLLERAYCON0_SETMASK)
    #if (MCU_SAFETY_ENABLE == STD_ON)
     MCU_SAFETY_SETSAFETYENDINIT_TIMED(MCU_SID_SETMODE);
    #else
     MCU_SFR_RUNTIME_SETSAFETYENDINIT_TIMED();
    #endif 

    #if (MCU_SAFETY_ENABLE == STD_ON)
     MCU_SAFETY_RESETSAFETYENDINIT_TIMED(MCU_SID_SETMODE,\
                                           MCU_SAFETY_ENDINT_TIMEOUT);
    #else
     MCU_SFR_RUNTIME_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
    #endif 
    /* PLL block is put into the Power Saving Mode */

