sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/mcu/Mcu_Platform.c
    MCU_SFR_RUNTIME_MODIFY32(SCU_PLLCON0.U,MCU_PLLCON0_CLEARMASK1,0U)

    /*Reserve bit access is ensured for PLLERAYCON0 register*/
    MCU_SFR_RUNTIME_MODIFY32(SCU_PLLERAYCON0.U,MCU_PLLERAYCON0_CLEARMASK1,0U)

    /* Set TRSIEN to enable write to TRISREQ */
    /* Set all pads to tristate and enable Standby RAM for CPU0 */

    MCU_SFR_RUNTIME_MODIFY32(MODULE_SCU.PMSWCR0.U,MCU_PMSWCR0_CLEARMASK,\
                                                            MCU_PMSWCR0_SETMASK)

    /*Set STBYEVEN to enable write to STBYEV*/
    /* Configure IRADIS bit to disable Idle Request Acknowledge sequence
    activation for fast Standby Mode entry. This ensures that standby
    request is not blocked by a pending reset request/sequence*/


    MCU_SFR_RUNTIME_MODIFY32(SCU_PMSWCR1.U,MCU_PMSWCR1_CLEARMASK,\
                                                            MCU_PMSWCR1_SETMASK)

    #if (MCU_SAFETY_ENABLE == STD_ON)
     MCU_SAFETY_SETSAFETYENDINIT_TIMED(MCU_SID_SETMODE);
    #else
     MCU_SFR_RUNTIME_SETSAFETYENDINIT_TIMED();
    #endif 

    /* Request the Standy mode */
    #if (MCU_SAFETY_ENABLE == STD_ON)
     MCU_SAFETY_RESETSAFETYENDINIT_TIMED(MCU_SID_SETMODE,\
                                              MCU_SAFETY_ENDINT_TIMEOUT);
    #else
     MCU_SFR_RUNTIME_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
    #endif 

    MCU_SFR_RUNTIME_MODIFY32(SCU_PMCSR0.U,~(((uint32)~(MCU_STANDBY+1U) &\
                       IFX_SCU_PMCSR_REQSLP_MSK)<<IFX_SCU_PMCSR_REQSLP_OFF),\
               ((uint32)(MCU_STANDBY+1U) & (uint32)IFX_SCU_PMCSR_REQSLP_MSK)\
                                  <<IFX_SCU_PMCSR_REQSLP_OFF)

    #if (MCU_SAFETY_ENABLE == STD_ON)
     MCU_SAFETY_SETSAFETYENDINIT_TIMED(MCU_SID_SETMODE);
    #else
     MCU_SFR_RUNTIME_SETSAFETYENDINIT_TIMED();
    #endif 
  }
}/*End of Mcu_lSetStandbyMode()*/

#if (MCU_CRC_HW_USED == STD_ON)
/*******************************************************************************
** Syntax : Std_ReturnType Mcu_lCrcPlatformInit (void)                        **
**                                                                            **
** Service ID:    None                                                        **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non-reentrant                                               **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value    :    E_OK - if initialization is success                   **
**                      E_NOT_OK - if initialization  fails                   **
**                                                                            **
** Description :  This service shall verify the platform specific             **
**                Crc initialization done by MCU.                             **
**                                                                            **
*******************************************************************************/
Std_ReturnType Mcu_lCrcPlatformInit(void)
{
  Std_ReturnType RetVal;
  /* Call the CRC_init */
  RetVal = Mcu_lCrcInit();

return(RetVal);
} /*End of Mcu_lCrcInit()*/
#endif

#if (MCU_SAFETY_ENABLE == STD_ON)
/*******************************************************************************
** Syntax : Std_ReturnType Mcu_lPlatformInitCheck (void)                      **
**                                                                            **
** Service ID:    None                                                        **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non-reentrant                                               **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value    :    E_OK - if initialization comparison is success        **
**                      E_NOT_OK - if initialization comparison fails         **
**                                                                            **
** Description :  This service shall verify the platform specific             **
**                initialization done by MCU.                                 **
**                                                                            **
*******************************************************************************/
Std_ReturnType Mcu_lPlatformInitCheck(void)
{
  Std_ReturnType ErrorFlag;
  uint32         TempFlag;
  uint32         TempFlag1;
  volatile uint32 CompareFlag = 0xFFFFFFFFU;

  ErrorFlag = E_OK;

  if (Mcu_kConfigPtr->StandbyCfgPtr != NULL_PTR)
  {
    TempFlag = (uint32)(MCU_SFR_INIT_USER_MODE_READ32(SCU_PMSWCR0.U)) &\
                                                            MCU_PMSWCR0_MASK;
    TempFlag1 = Mcu_kConfigPtr->StandbyCfgPtr->PMSWCR0;

    CompareFlag &= (TempFlag ^ ~TempFlag1);
  }

  TempFlag = MCU_CCUCON0_MASK_CLOCK_DIVIDERS | MCU_CLKSEL_IS_PLL_AS_SOURCE;
  TempFlag1 = MCU_SFR_INIT_USER_MODE_READ32(SCU_CCUCON0.U);
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
  CompareFlag &= (TempFlag1 & TempFlag) ^
     ~((Mcu_kConfigPtr->ClockCfgPtr[Mcu_ClockSetting].Ccucon0 |
        MCU_CLKSEL_IS_PLL_AS_SOURCE)
        & TempFlag);

  TempFlag = MCU_CCUCON1_MASK_CLOCK_DIVIDERS | MCU_INSEL_IS_FOSC0_AS_SOURCE;
  TempFlag1 = MCU_SFR_INIT_USER_MODE_READ32(SCU_CCUCON1.U);
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
  CompareFlag &= (TempFlag1 & TempFlag) ^
     ~((Mcu_kConfigPtr->ClockCfgPtr[Mcu_ClockSetting].Ccucon1 |
        MCU_INSEL_IS_FOSC0_AS_SOURCE)
        & TempFlag);

  TempFlag = MCU_CCUCON2_MASK_CLOCK_DIVIDERS;
  TempFlag1 = MCU_SFR_INIT_USER_MODE_READ32(SCU_CCUCON2.U);
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
  CompareFlag &= (TempFlag1 & TempFlag) ^
     ~(Mcu_kConfigPtr->ClockCfgPtr[Mcu_ClockSetting].Ccucon2 & TempFlag);

  TempFlag = MCU_CCUCON5_MASK_CLOCK_DIVIDERS;
  TempFlag1 = MCU_SFR_INIT_USER_MODE_READ32(SCU_CCUCON5.U);
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
  CompareFlag &= (TempFlag1 & TempFlag) ^
     ~(Mcu_kConfigPtr->ClockCfgPtr[Mcu_ClockSetting].Ccucon5 & TempFlag);

  TempFlag = MCU_CCUCON6_MASK_CLOCK_DIVIDERS;
  TempFlag1 = MCU_SFR_INIT_USER_MODE_READ32(SCU_CCUCON6.U);
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used due to
      PBConfigStructure and is within allowed range*/
  CompareFlag &= (TempFlag1 & TempFlag) ^
     ~(Mcu_kConfigPtr->ClockCfgPtr[Mcu_ClockSetting].Ccucon6 & TempFlag);

